# Chapter 8: Data Wrangling: Join, Combine, and Reshap

## 8.1: Hierarchical Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.Series(np.random.uniform(size=9),
               index=[["a","a","a","b","b","c","c","d","d"],[1,2,3,1,3,1,2,2,3]])
data

a  1    0.467289
   2    0.262827
   3    0.202700
b  1    0.172272
   3    0.358150
c  1    0.286196
   2    0.248847
d  2    0.559040
   3    0.389387
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data["b"]

1    0.172272
3    0.358150
dtype: float64

In [5]:
data["b":"c"]

b  1    0.172272
   3    0.358150
c  1    0.286196
   2    0.248847
dtype: float64

In [6]:
data.loc[["b","d"]]

b  1    0.172272
   3    0.358150
d  2    0.559040
   3    0.389387
dtype: float64

In [7]:
data.loc[:,2]

a    0.262827
c    0.248847
d    0.559040
dtype: float64

In [8]:
data.unstack()

          1         2         3
a  0.467289  0.262827  0.202700
b  0.172272       NaN  0.358150
c  0.286196  0.248847       NaN
d       NaN  0.559040  0.389387

In [9]:
data.unstack().stack()

a  1    0.467289
   2    0.262827
   3    0.202700
b  1    0.172272
   3    0.358150
c  1    0.286196
   2    0.248847
d  2    0.559040
   3    0.389387
dtype: float64

In [10]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[["a","a","b","b"],[1,2,1,2]],
                   columns=[["Ohio","Ohio","Colorado"],["Green","Red","Green"]])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [11]:
frame.index.names=["key1","key2"]
frame.columns.names=["state","color"]
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [12]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['key1', 'key2'])

In [13]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [14]:
frame.index.nlevels

2

In [15]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [16]:
pd.MultiIndex.from_arrays([["Ohio","Ohio","Colorado"],["Green","Red","Green"]],
                          names=["state","color"])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

### Reordering and Sorting Levels

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame.swaplevel("key1","key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [19]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [21]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [22]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [23]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['key1', 'key2'])

### Summary Statistics by Level

In [24]:
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [25]:
frame.groupby(level="color",axis="columns").sum()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_1408\3295922660.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(level="color",axis="columns").sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

In [26]:
frame=pd.DataFrame({"a":range(7),"b":range(7,0,-1),
                    "c":["one","one","one","two","two","two","two"],
                    "d":[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [27]:
frame2=frame.set_index(["c","d"])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [28]:
frame.set_index(["c","d"],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [29]:
frame.set_index(["d","c"])

       a  b
d c
0 one  0  7
1 one  1  6
2 one  2  5
0 two  3  4
1 two  4  3
2 two  5  2
3 two  6  1

In [30]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [31]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2: Combining and Merging Datasets

### Database-Style DataFrame Joins

In [32]:
df1=pd.DataFrame({"key":["b","b","a","c","a","a","b"],
                  "data1":pd.Series(range(7),dtype="Int64")})
df2=pd.DataFrame({"key":["a","b","d"],
                  "data2":pd.Series(range(3),dtype="Int64")})
df1
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [33]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [34]:
pd.merge(df1,df2,on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [35]:
df3=pd.DataFrame({"lkey":["b","b","a","c","a","a","b"],
                  "data1":pd.Series(range(7),dtype="Int64")})
df4=pd.DataFrame({"rkey":["a","b","d"],
                  "data2":pd.Series(range(3),dtype="Int64")})
df3
df4

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

  rkey  data2
0    a      0
1    b      1
2    d      2

In [36]:
pd.merge(df3,df4,left_on="lkey",right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [37]:
df1
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [38]:
pd.merge(df1,df2,how="outer")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [39]:
pd.merge(df1,df2,how="right")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   d   <NA>      2

In [40]:
pd.merge(df1,df2,how="left")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [41]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey", how="outer")

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [42]:
df1=pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":pd.Series(range(6),dtype="Int64")})
df2=pd.DataFrame({"key":["a","b","a","b","d"],
                  "data2":pd.Series(range(5),dtype="Int64")})
df1
df2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [43]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [44]:
pd.merge(df1,df2,on="key",how="left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [45]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [46]:
pd.merge(df1,df2,how="inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [47]:
left=pd.DataFrame({"key1":["foo","foo","bar"],
       "key2":["one","two","one"],
       "lval":pd.Series([1,2,3],dtype="Int64")})
right=pd.DataFrame({"key1":["foo","foo","bar","bar"],
        "key2":["one","one","one","two"],
        "rval":pd.Series([4,5,6,7],dtype="Int64")})
left
right

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [48]:
pd.merge(left,right,on=["key1","key2"],how="outer")

  key1 key2  lval  rval
0  bar  one     3     6
1  bar  two  <NA>     7
2  foo  one     1     4
3  foo  one     1     5
4  foo  two     2  <NA>

In [49]:
pd.merge(left,right,on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [50]:
pd.merge(left,right,on="key1",suffixes=("_left","_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In [51]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                      "value": pd.Series(range(6), dtype="Int64")})
right1=pd.DataFrame({"group_val":[3.5,7]},index=["a","b"])
left1
right1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

   group_val
a        3.5
b        7.0

In [52]:
pd.merge(left1,right1,left_on="key",right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [53]:
pd.merge(left1,right1,left_on="key",right_index=True,how="outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [54]:
lefth=pd.DataFrame({"key1":["Ohio","Ohio","Ohio","Nevada","Nevada"],
                    "key2":[2000,2001,2002,2001,2002],
                    "data":pd.Series(range(5),dtype="Int64")})
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [55]:
righth_index=pd.MultiIndex.from_arrays(
    [
        ["Nevada","Nevada","Ohio","Ohio","Ohio","Ohio"],
        [2001,2000,2000,2000,2001,2002]
    ]
)
righth_index

MultiIndex([('Nevada', 2001),
            ('Nevada', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2001),
            (  'Ohio', 2002)],
           )

In [57]:
righth=pd.DataFrame({"event1":pd.Series([0,2,4,6,8,10],dtype="Int64",index=righth_index),
                     "event2":pd.Series([1,3,5,7,9,11],dtype="Int64",index=righth_index)})

righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [58]:
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [59]:
pd.merge(lefth,righth,left_on=["key1","key2"],right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [62]:
pd.merge(lefth,righth,left_on=["key1","key2"],right_index=True,how="outer")

     key1  key2  data  event1  event2
4  Nevada  2000  <NA>       2       3
3  Nevada  2001     3       0       1
4  Nevada  2002     4    <NA>    <NA>
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11

In [65]:
left2=pd.DataFrame([[1,2],[3,4],[5,6]],
                   index=["a","c","e"],
                   columns=["Ohio","Nevada"])
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [66]:
right2=pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],
                    index=["b","c","d","e"],
                    columns=["Missouri","Alabama"])
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [67]:
pd.merge(left2,right2,left_index=True,right_index=True,how="outer")

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [68]:
left2.join(right2,how="outer")

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [69]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [70]:
right1

   group_val
a        3.5
b        7.0

In [71]:
left1.join(right1,on="key")

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [72]:
left2
right2
another=pd.DataFrame([[7,8],[9,10],[11,12],[16,17]],
                     index=["a","c","e","f"],
                     columns=["New York","Oregon"])
another

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [73]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [75]:
left2.join([right2,another],how="outer")

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [76]:
a=pd.DataFrame({"ID":[1,2,3,4],
                "Score1":[1,1,0,1],
                "Score2":[1,1,1,1]})
a

   ID  Score1  Score2
0   1       1       1
1   2       1       1
2   3       0       1
3   4       1       1

In [77]:
b=pd.DataFrame({"ID1":[1,3,4,6,2],
                "Score3":[0,1,0,1,0],
                "Score4":[1,1,0,1,0]})
b

   ID1  Score3  Score4
0    1       0       1
1    3       1       1
2    4       0       0
3    6       1       1
4    2       0       0

In [80]:
pd.merge(a,b,left_on="ID",right_on="ID1",how="outer")

    ID  Score1  Score2  ID1  Score3  Score4
0  1.0     1.0     1.0    1       0       1
1  2.0     1.0     1.0    2       0       0
2  3.0     0.0     1.0    3       1       1
3  4.0     1.0     1.0    4       0       0
4  NaN     NaN     NaN    6       1       1

### Concatenating Along Axis

In [81]:
arr=np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [83]:
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [84]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [85]:
s1=pd.Series([0,1],index=["a","b"],dtype="Int64")
s2=pd.Series([2,3,4],index=["c","d","e"],dtype="Int64")
s3=pd.Series([5,6],index=["f","g"],dtype="Int64")
s1
s2
s3

a    0
b    1
dtype: Int64

c    2
d    3
e    4
dtype: Int64

f    5
g    6
dtype: Int64

In [89]:
np.concatenate([s1,s2,s3])

array([0, 1, 2, 3, 4, 5, 6], dtype=int64)

In [90]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [91]:
pd.concat([s1,s2,s3],axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [92]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [93]:
s1

a    0
b    1
dtype: Int64

In [95]:
pd.concat([s1,s4],axis="columns")

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [97]:
pd.concat([s1,s4],axis="columns",join="inner")

   0  1
a  0  0
b  1  1

In [100]:
result=pd.concat([s1,s1,s3],keys=["one","two","three"])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: Int64

In [101]:
result.unstack()

          a     b     f     g
one       0     1  <NA>  <NA>
two       0     1  <NA>  <NA>
three  <NA>  <NA>     5     6

In [102]:
pd.concat([s1,s1,s3],axis="columns",keys=["one","two","three"])

    one   two  three
a     0     0   <NA>
b     1     1   <NA>
f  <NA>  <NA>      5
g  <NA>  <NA>      6

In [104]:
df1=pd.DataFrame(np.arange(6).reshape((3,2)),index=["a","b","c"],columns=["one","two"])
df2=pd.DataFrame(5+np.arange(4).reshape((2,2)),index=["a","c"],columns=["three","four"])
df1
df2

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

In [106]:
pd.concat([df1,df2],axis="columns")

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [107]:
pd.concat([df1,df2],axis="columns",keys=["level1","level2"])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [109]:
pd.concat({"level1":df1,"level2":df2},axis="columns")

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [110]:
pd.concat([df1,df2],axis="columns",keys=["level1","level2"],names=["upper","lower"])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [111]:
df1=pd.DataFrame(np.random.standard_normal((3,4)),columns=["a","b","c","d"])
df2=pd.DataFrame(np.random.standard_exponential((2,3)),columns=["b","d","a"])

In [112]:
df1
df2

          a         b         c         d
0  0.970531 -0.040342 -0.649718  0.599971
1  1.174872  0.965373  1.877448 -0.602218
2 -0.103856  0.170727 -1.971545 -0.195891

          b         d         a
0  1.804207  1.310344  4.330263
1  2.023344  1.632843  3.688692

In [113]:
pd.concat([df1,df2])

          a         b         c         d
0  0.970531 -0.040342 -0.649718  0.599971
1  1.174872  0.965373  1.877448 -0.602218
2 -0.103856  0.170727 -1.971545 -0.195891
0  4.330263  1.804207       NaN  1.310344
1  3.688692  2.023344       NaN  1.632843

In [114]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0  0.970531 -0.040342 -0.649718  0.599971
1  1.174872  0.965373  1.877448 -0.602218
2 -0.103856  0.170727 -1.971545 -0.195891
3  4.330263  1.804207       NaN  1.310344
4  3.688692  2.023344       NaN  1.632843

### Combining Data with Overlap

In [115]:
a=pd.Series([np.nan,2.5,0,3.5,4.5,np.nan],
            index=["f","e","d","c","b","a"])
b=pd.Series([0,np.nan,2,np.nan,np.nan,5],
            index=["a","b","c","d","e","f"])
a
b

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [116]:
pd.isna(a)

f     True
e    False
d    False
c    False
b    False
a     True
dtype: bool

In [117]:
np.where(pd.isna(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [118]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [122]:
df1=pd.DataFrame({"a":[1,np.nan,5,np.nan],
                  "b":[np.nan,2,np.nan,6],
                  "c":range(2,18,4)})

df2=pd.DataFrame({"a":[5,4,np.nan,3,7],
                  "b":[np.nan,3,4,6,8]})
df1
df2

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [124]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## 8.3: Reshaping and Pivoting

### Reshaping with Hierarchical Indexing

In [125]:
data=pd.DataFrame(np.arange(6).reshape((2,3)),
                  index=pd.Index(["Ohio","Colorado"],name="state"),
                  columns=pd.Index(["one","two","three"],name="number"))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [128]:
result=data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [129]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [130]:
result.unstack(level=1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [131]:
result.unstack(level=0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [132]:
result.unstack(level="state")

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [134]:
s1=pd.Series([0,1,2,3],index=["a","b","c","d"],dtype="Int64")
s2=pd.Series([4, 5, 6], index=["c", "d", "e"], dtype="Int64")
s1
s2

a    0
b    1
c    2
d    3
dtype: Int64

c    4
d    5
e    6
dtype: Int64

In [136]:
data2=pd.concat([s1,s2],keys=["one","two"])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [137]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [138]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [139]:
data2.unstack().stack(dropna=False)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_1408\3936770077.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  data2.unstack().stack(dropna=False)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [140]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [153]:
pd.DataFrame({"left":result,"right":result+5},columns=pd.Index(["left","right"],name="side"))
pd.DataFrame({"left":result,"right":result+5})

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

                 left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [154]:
pd.DataFrame({"left":result,"right":result+5},columns=pd.Index(["left","right"],name="side")).columns

Index(['left', 'right'], dtype='object', name='side')

In [152]:
pd.DataFrame({"left":result,"right":result+5}).columns

Index(['left', 'right'], dtype='object')

In [155]:
df=pd.DataFrame({"left":result,"right":result+5},columns=pd.Index(["left","right"],name="side"))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [156]:
df.unstack()

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [157]:
df.unstack(level="state")

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [159]:
df.unstack(level=0)

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [160]:
df.unstack(level="number")

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

### Pivoting "Long" to "Wide" Format

### Pivoting "Wide" to "Long" Format